app/controllers/usuarios_controller.rb

  def update
    current_query_string = URI(request.url).query
    if current_query_string.include? "id"
      json_response({ error: 'id no es modificable' }, :bad_request)
    else
      @usuario.update(usuario_params)
---
UPDATE "usuarios" SET "twitter" = ?, "updated_at" = ? WHERE "usuarios"."id" = ?  [["twitter", "imarquezc"], ["updated_at", 2017-03-27 14:57:06 UTC], ["id", 4]]

  def index
    @usuarios = Usuario.all
    json_response({'usuarios' => @usuarios }.merge('total' => @usuarios.count))
---
SELECT "usuarios".* FROM "usuarios"
SELECT COUNT(*) FROM "usuarios"

  def create
    body_request = request.raw_post
    if body_request.include? '"id"'
      json_response({ error: 'No se puede crear usuario con id' }, :bad_request)
    else
      @usuario = Usuario.new(usuario_params)
      if @usuario.save
---
INSERT INTO "usuarios" ("usuario", "nombre", "apellido", "twitter", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["usuario", "jperez"], ["nombre", "Juan"], ["apellido", "Pérez"], ["twitter", "jperez1990"], ["created_at", 2017-03-28 12:31:47 UTC], ["updated_at", 2017-03-28 12:31:47 UTC]]